Hva med sånn? Terraform plan (i `digitalekanaler-admin-frontend`) blir sånn med denne koden:

```
Terraform will perform the following actions:

  # module.app.module.cloudfront_ssr.aws_cloudfront_distribution.this will be updated in-place
  ~ resource "aws_cloudfront_distribution" "this" {
        id                              = "E1PMI16XYQAPYK"
        tags                            = {}
        # (23 unchanged attributes hidden)

      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "471112960535-digitalekanaler-admin-static-files.s3-website-eu-west-1.amazonaws.com" -> null
          - origin_id                = "digitalekanaler-admin-s3-origin" -> null
            # (2 unchanged attributes hidden)

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "http-only" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1.2",
                ] -> null
            }
        }
      - origin {
          - connection_attempts      = 3 -> null
          - connection_timeout       = 10 -> null
          - domain_name              = "lb.vylabs.io" -> null
          - origin_id                = "digitalekanaler-admin-alb-origin" -> null
            # (2 unchanged attributes hidden)

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "https-only" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1.2",
                ] -> null
            }
        }
      + origin {
          + connection_attempts      = 3
          + connection_timeout       = 10
          + domain_name              = "471112960535-digitalekanaler-admin-static-files.s3-website-eu-west-1.amazonaws.com"
          + origin_access_control_id = (known after apply)
          + origin_id                = "digitalekanaler-admin-s3-origin"
            # (1 unchanged attribute hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }
      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "lb.vylabs.io"
          + origin_id           = "digitalekanaler-admin-alb-origin"
            # (1 unchanged attribute hidden)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "https-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.app.module.cloudfront_ssr.aws_cloudfront_origin_access_control.this will be created
  + resource "aws_cloudfront_origin_access_control" "this" {
      + arn                               = (known after apply)
      + description                       = "OAC for digitalekanaler-admin"
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + name                              = "digitalekanaler-admin"
      + origin_access_control_origin_type = "s3"
      + signing_behavior                  = "always"
      + signing_protocol                  = "sigv4"
    }

  # module.app.module.cloudfront_ssr.aws_ssm_parameter.for_pipeline will be created
  + resource "aws_ssm_parameter" "for_pipeline" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/__deployment__/applications/digitalekanaler-admin/cloudfront_domain_name"
      + region         = "eu-west-1"
      + tags_all       = {
          + "application" = "digitalekanaler-admin"
          + "repo"        = "digitalekanaler-admin-frontend"
          + "terraform"   = "true"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.app.module.s3_website_bucket.aws_s3_bucket_policy.website_bucket will be updated in-place
  ~ resource "aws_s3_bucket_policy" "website_bucket" {
        id     = "471112960535-digitalekanaler-admin-static-files"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Effect    = "Allow"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::471112960535-digitalekanaler-admin-static-files",
                          - "arn:aws:s3:::471112960535-digitalekanaler-admin-static-files/*",
                        ]
                      - Sid       = "PublicReadGetObject"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.app.module.s3_website_bucket.aws_s3_bucket_public_access_block.website_bucket will be updated in-place
  ~ resource "aws_s3_bucket_public_access_block" "website_bucket" {
      ~ block_public_acls       = false -> true
      ~ block_public_policy     = false -> true
        id                      = "471112960535-digitalekanaler-admin-static-files"
      ~ ignore_public_acls      = false -> true
      ~ restrict_public_buckets = false -> true
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 0 to destroy.
╷
│ Warning: Deprecated attribute
│
│   on .terraform/modules/app.ssr_task/main.tf line 359, in resource "aws_ecs_task_definition" "task":
│  359:           "awslogs-region" : data.aws_region.current.name,
│
│ The attribute "name" is deprecated. Refer to the provider documentation for details.
╵
```